#
# Homebrew
#


#
# Development
#

brew 'ffmpeg'
brew 'git'
brew 'git-extras'
brew 'gh'
brew 'mise'
brew 'swiftlint'
brew 'uv'
brew 'yt-dlp'
## Work only
#brew gpg
#brew gawk
#brew pnpm
#brew mkcert
#brew nss
#brew postgresql@13
#brew redis
#brew libxmlsec1
#brew fabric

#
# Utilities
#

#brew 'imagemagick'
#brew 'jpeg'


#
# Homebrew Cask
#

cask_args appdir: '/Applications'


#
# Essentials
#

#http://www.shirt-pocket.com/SuperDuper/SuperDuperDescription.html
cask 'superduper'


#
# Development
#

#http://imageoptim.com/
cask 'imageoptim'

#https://iterm2.com
cask 'iterm2'

#https://code.visualstudio.com
cask 'visual-studio-code'

#https://www.docker.com/products/docker-desktop
cask 'docker-desktop'

#https://claude.ai/download
cask 'claude-code'


#
# Browsers
#

#https://www.google.com/chrome/downloads/
cask 'google-chrome'

#https://www.google.com/chrome/canary/
cask 'google-chrome@canary'

#http://www.chromium.org/
#cask 'chromium'

#http://www.mozilla.org/en-US/firefox/new/
cask 'firefox'

#https://www.microsoft.com/en-us/edge
cask 'microsoft-edge'


#
# Others
#

#http://www.figma.com
cask 'figma'

#https://rectangleapp.com/pro
cask 'rectangle-pro'

#https://playbeta.pocketcasts.com/
cask 'pocket-casts'

#http://stellarium.org/
cask 'stellarium'

#https://www.coconut-flavour.com/coconutbattery/
cask 'coconutbattery'

#https://www.notion.so
cask 'notion'

#https://claude.ai
cask 'claude'

#https://discord.com
cask 'discord'

#https://www.logitech.com/en-us/software/logi-options-plus.html
cask 'logi-options+'


#
# Mac App Store
#

mas '1Password7', id: 1333542190
mas 'Bear', id: 1091189122
mas 'DaisyDisk', id: 411643860
mas 'Darkroom', id: 953286746
mas 'Fantastical', id: 975937182
mas 'iA Writer', id: 775737590
mas 'Patterns', id: 429449079
mas 'Pixelmator', id: 407963104
mas 'Poolsuite FM', id: 1514817810
mas 'Shush', id: 496437906
mas 'Sim Daltonism', id: 693112260
mas 'Slack', id: 803453959
mas 'Sleeve', id: 1606145041
mas 'Spark', id: 1176895641
mas 'Todoist', id: 585829637
